# SetAttribute Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCAnyHandle..::..SetAttribute Method
IFCAnyHandle Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetAttribute(String, IFCAnyHandle) | Sets the attribute value. |
| SetAttribute(String, IFCData) | Sets the attribute value. |
| SetAttribute(String, Boolean) | Sets the attribute value. |
| SetAttribute(String, IList<(Of <<'(IFCAnyHandle>)>>)) |
| SetAttribute(String, IList<(Of <<'(Boolean>)>>)) |
| SetAttribute(String, IList<(Of <<'(Double>)>>)) |
| SetAttribute(String, IList<(Of <<'(Int32>)>>)) |
| SetAttribute(String, IList<(Of <<'(String>)>>)) |
| SetAttribute(String, ISet<(Of <<'(IFCAnyHandle>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Boolean>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Double>)>>)) |
| SetAttribute(String, ISet<(Of <<'(Int32>)>>)) |
| SetAttribute(String, ISet<(Of <<'(String>)>>)) |
| SetAttribute(String, Double) | Sets the attribute value. |
| SetAttribute(String, Int32) | Sets the attribute value. |
| SetAttribute(String, String) | Sets the attribute value. |

# See Also
IFCAnyHandle Class
IFCAnyHandle Members
Autodesk.Revit.DB.IFC Namespace